experiments/location-transport/results/rabbit-k6-B.txt
time="2026-09-25T17:26:11+09:00" level=warning msg="Insufficient VUs, reached 300 active VUs and cannot initialize more" executor=constant-arrival-rate scenario=ingest


  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=330.01µs p(50)=164µs    p(95)=286µs    p(99)=2.08ms max=327.29ms
      { expected_response:true }...: avg=330.01µs p(50)=164µs    p(95)=286µs    p(99)=2.08ms max=327.29ms
    http_req_failed................: 0.00%  0 out of 899659
    http_reqs......................: 899659 2998.851918/s

    EXECUTION
    dropped_iterations.............: 342    1.139996/s
    iteration_duration.............: avg=368.09µs p(50)=195.66µs p(95)=342.29µs p(99)=2.17ms max=328.09ms
    iterations.....................: 899659 2998.851918/s
    vus............................: 0      min=0           max=7  
    vus_max........................: 300    min=300         max=300

    NETWORK
    data_received..................: 66 MB  220 kB/s
    data_sent......................: 209 MB 697 kB/s